{
  "backend/main.mo": "Main Motoko actor for the MikupBeats platform defining data types (Beat, Mixtape, RightsFolder, etc.) and managing beats, mixtapes, showcase highlights, and licensing with stable storage via preupgrade/postupgrade hooks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each component's purpose and notable implementation details.",
  "frontend/DEPLOYMENT_DEBUGGING.md": "Guide for capturing and debugging deployment issues for MikupBeats, recommending an automated retry wrapper script.",
  "frontend/index.html": "Root HTML entry point for the MikupBeats frontend, mounting the React app at the #root div and loading main.tsx as a module.",
  "frontend/index.ts": "Minimal file containing a JSX-like snippet rendering an author name with an 'Anonymous' fallback; appears to be a fragment or placeholder.",
  "frontend/scripts/capture-deploy-output.ps1": "PowerShell script that runs dfx deploy, captures all output to a timestamped log file, and redacts sensitive secrets (Stripe keys, bearer tokens) before saving.",
  "frontend/scripts/capture-deploy-output.sh": "Bash script that runs dfx deploy, captures stdout/stderr to a timestamped log file, redacts sensitive secrets, and prints troubleshooting hints on failure.",
  "frontend/scripts/retry-deploy-with-capture.mjs": "Cross-platform Node.js script that detects the OS and invokes the appropriate deployment capture script (PowerShell or Bash), then prints a structured success/failure summary with troubleshooting guidance.",
  "frontend/src/App.tsx": "Main application entry point that sets up React Query, TanStack Router with all page routes, and a Layout component handling authentication redirects and Stripe return flows.",
  "frontend/src/components/AdminHelpSection.tsx": "Accordion-based help/documentation component for admins that describes platform features including authentication roles, beat store browsing, and checkout functionality.",
  "frontend/src/components/AdminPage.tsx": "Empty file with no content.",
  "frontend/src/components/AdminPanel.tsx": "Empty file with no content.",
  "frontend/src/components/AnalyticsSection.tsx": "Admin analytics dashboard displaying total visits, unique visitors, daily visit line charts, and per-page visit counts, with a toggle to exclude the current admin from visitor tracking.",
  "frontend/src/components/ApprovalManagement.tsx": "Empty file with no content.",
  "frontend/src/components/ApprovalRequest.tsx": "Empty file with no content.",
  "frontend/src/components/AssetManagementSection.tsx": "Admin UI for browsing and downloading uploaded assets by type (audio, preview, cover art, license), currently showing a 'not yet implemented' warning since the backend endpoint is missing.",
  "frontend/src/components/BasicRightsLicenseManagement.tsx": "Admin component for uploading, downloading, and deleting the M.v.A Basic Rights License document (PDF/DOC/TXT, max 10MB) that is bundled with beat ZIP downloads.",
  "frontend/src/components/BeatCard.tsx": "A card component for displaying a beat with play/pause preview (capped at 60s), purchase buttons for different rights tiers, and support for both free and paid (Stripe) checkout flows.",
  "frontend/src/components/BeatManagementSection.tsx": "An admin section component that lists all uploaded beats in an accordion, allowing the admin to edit, delete, or reopen sold rights for each beat.",
  "frontend/src/components/BeatReviewSection.tsx": "An empty file with no content.",
  "frontend/src/components/BeatsSection.tsx": "An empty file with no content.",
  "frontend/src/components/BeatUploadSection.tsx": "A form component for uploading new beats, supporting metadata fields, cover art, audio/video preview, and rights folders (ZIP or Google Drive links) with pricing for basic, premium, exclusive, and stems tiers.",
  "frontend/src/components/CreateThreadDialog.tsx": "A dialog component for creating a new chat room section with a title, description, and optional link-sharing toggle, submitting via a mutation hook.",
  "frontend/src/components/DeployDiagnosticsBanner.tsx": "A dismissible fixed banner that displays build metadata (environment, version, canister ID) and troubleshooting tips, shown only in development or when explicitly enabled via localStorage.",
  "frontend/src/components/DynamicHomeSequence.tsx": "A background animation component for the home page that renders animated gradient orbs and a studio image with configurable intensity, focus mode, and audio settings persisted to localStorage.",
  "frontend/src/components/EditBeatDialog.tsx": "A dialog component for editing an existing beat's metadata (title, artist, category, style, texture, delivery method) and associated files (preview, cover art, rights ZIP folders, Google Drive links) with upload progress tracking and audio preview playback.",
  "frontend/src/components/ExclusiveRightsLicenseManagement.tsx": "A card component for uploading, downloading, and deleting the exclusive rights license document (PDF/DOC/TXT, max 10MB) that is automatically included with exclusive right ZIP downloads.",
  "frontend/src/components/FeaturedBeatManagement.tsx": "An admin card component that allows selecting a beat from the catalog to feature on the Store page, and clearing the currently featured beat.",
  "frontend/src/components/FeaturedBeatSection.tsx": "A store-facing section that displays the currently featured beat with its cover art, play/pause controls via the global audio player, and a navigation link to the beat's detail page.",
  "frontend/src/components/FloatingAdminButton.tsx": "An empty file with no content or exports.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/HamburgerMenu.tsx": "A slide-out sheet navigation menu triggered by a fixed hamburger button, providing links to all main app routes and login/logout functionality via Internet Identity.",
  "frontend/src/components/Header.tsx": "A sticky top header displaying the MikupBeats logo/branding, the authenticated user's profile name, and a logout button (or guest mode label when unauthenticated).",
  "frontend/src/components/InteractiveTimeline.tsx": "Renders a horizontally scrollable milestone timeline with left/right navigation buttons for desktop and a vertical card layout for mobile, fetching data via the useGetMilestones hook.",
  "frontend/src/components/LiveShowsManagement.tsx": "Admin component for managing upcoming live shows and replays, providing tabbed CRUD dialogs backed by React Query mutation hooks with toast notifications.",
  "frontend/src/components/LiveStreamCard.tsx": "Empty file with no content.",
  "frontend/src/components/LiveStreamSection.tsx": "Empty file with no content.",
  "frontend/src/components/MilestoneManagement.tsx": "Admin component for creating, editing, and deleting milestones with optional media upload, using saveMilestone and deleteMilestone mutation hooks and displaying items in a dialog form.",
  "frontend/src/components/MixtapeApprovalSection.tsx": "Admin section that lists pending mixtapes and allows approving (with a showcase highlight track selection), rejecting, or deleting them, with audio preview playback support.",
  "frontend/src/components/MixtapeCard.tsx": "Displays a single mixtape card with cover art, track navigation, play/pause controls, and a delete option available to admins or the uploader.",
  "frontend/src/components/MixtapeSubmissionFeeConfig.tsx": "Admin UI component for configuring mixtape submission fees, allowing toggling paid submissions on/off and setting the price in USD, which is saved via a mutation hook.",
  "frontend/src/components/MixtapeSubmissionForm.tsx": "Dialog form component for artists to submit mixtapes/albums, handling file uploads (cover art and audio in MP3/M4A/WAV), external links, and optionally redirecting to a Stripe checkout if submission fees are enabled.",
  "frontend/src/components/MvaPreviewUploadSection.tsx": "Admin section component for uploading, previewing, and deleting an M.v.A audio/video preview file, with playback controls integrated via the AudioPlayerContext.",
  "frontend/src/components/PremiumRightsLicenseManagement.tsx": "Admin component for managing a Premium Rights License document, supporting upload (PDF/DOC/TXT up to 10MB), download, and deletion of the license file.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for new users to complete their profile by entering a name and optionally marking themselves as a creator, saved via a mutation hook.",
  "frontend/src/components/QuickLinkBar.tsx": "Fixed bottom navigation bar rendering links to main app sections (Store, Showcase, Live, M.v.A, Music, Forum, Mixtapes) with an additional Admin link shown only to admins, highlighting the active route.",
  "frontend/src/components/ShowcaseApprovalSection.tsx": "Admin panel section for reviewing and approving pending showcase submissions, with options to approve individually, approve all, delete, and preview audio playback.",
  "frontend/src/components/ShowcaseCard.tsx": "Displays a single showcase entry as a card with cover art, play/pause audio toggle, metadata badges, and an admin-only delete option.",
  "frontend/src/components/ShowcaseHighlightCard.tsx": "Renders a featured mixtape track highlight card with play/pause functionality and a button to navigate to the full mixtapes page.",
  "frontend/src/components/ShowcaseSection.tsx": "Empty file with no content.",
  "frontend/src/components/StartStreamDialog.tsx": "Empty file with no content.",
  "frontend/src/components/StemsRightsLicenseManagement.tsx": "Admin component for uploading, downloading, and deleting the Stems Rights License document (PDF/DOC/TXT) that is bundled with Stems ZIP downloads.",
  "frontend/src/components/StripeConfigSection.tsx": "Admin form for configuring Stripe payment processing by entering a secret key and allowed countries, with status indicators for whether Stripe is already configured.",
  "frontend/src/components/StripeSetup.tsx": "Empty file with no content.",
  "frontend/src/components/UploadBeatDialog.tsx": "Empty file with no content.",
  "frontend/src/components/YouTubeConfigSection.tsx": "Admin form for saving or removing a YouTube live stream URL, with a live iframe preview of the entered URL.",
  "frontend/src/contexts/AudioPlayerContext.tsx": "Provides a React context for global audio playback management, exposing play, pause, and stop controls along with current playback state via a single shared HTMLAudioElement.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via AuthClient, providing a React context and hook with login/logout functionality, identity state, and login status tracking.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, covering beats, user profiles, showcases, Stripe, analytics, and other domain entities.",
  "frontend/src/hooks/useStripePreflight.ts": "Hook that checks whether Stripe is configured and exposes a flag and error message to gate paid checkout flows.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers and a dark-mode CSS variable theme using OKLCH colors (purple accents, matte grey backgrounds), plus overrides to force opaque backgrounds on Radix UI overlays.",
  "frontend/src/lib/audioConverter.ts": "Utility module for detecting, validating, and converting audio files to browser-compatible formats (WebM/Opus or MP4) using the MediaRecorder API when direct playback is unsupported.",
  "frontend/src/lib/beatRights.ts": "Provides utility functions and constants for beat licensing rights, including label generation, sold-status checks, purchase eligibility, and availability messaging based on exclusive/non-exclusive rights types.",
  "frontend/src/lib/buildMeta.ts": "Exposes build-time metadata (environment, version, build time, canister ID) via helper functions for retrieval, formatting, and console logging.",
  "frontend/src/lib/checkoutDebug.ts": "Provides structured, safe console logging utilities for checkout flow debugging, including event logging and error sanitization to strip sensitive keys/tokens.",
  "frontend/src/lib/mediaProcessor.ts": "Unified media processing utility that detects, validates, and processes audio and video files for preview playback, including audio extraction from video and trimming to 30 seconds.",
  "frontend/src/lib/mediaTrimmer.ts": "Client-side utility that trims audio or video files to a maximum of 30 seconds using MediaRecorder and captureStream, returning a new trimmed File object.",
  "frontend/src/lib/stripeCheckout.ts": "Provides Stripe checkout URL validation, error sanitization, and user-friendly error message constants for the checkout flow.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Empty About page component with no content defined.",
  "frontend/src/pages/AccountSetupPage.tsx": "Account setup page that allows authenticated users to set or update their display name and creator status, saving the profile via a mutation hook.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed navigation covering beat upload/management, featured beats, showcases, mixtapes, YouTube/Stripe config, live shows, milestones, MVA previews, license management, and analytics.",
  "frontend/src/pages/BeatDetailsPage.tsx": "Detail page for a single beat that displays preview playback, rights/license options, and handles both free and paid (Stripe checkout) purchase flows.",
  "frontend/src/pages/ForumPage.tsx": "Community forum page that lists chat room sections, allows admins to create or delete sections, and records page visits.",
  "frontend/src/pages/LivePage.tsx": "Live stream page that embeds a YouTube live URL and displays upcoming shows and past replays, with an admin prompt when no stream is configured.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page featuring a hero banner, logo, and Internet Identity login button, with a notice shown when a pending Stripe purchase is detected.",
  "frontend/src/pages/MainApp.tsx": "Empty file with no content.",
  "frontend/src/pages/MixtapesPage.tsx": "Page displaying approved mixtapes/albums in a searchable grid, with a submission form available to authenticated users.",
  "frontend/src/pages/MusicLinksPage.tsx": "Page for displaying and managing music links (Spotify, Apple Music, YouTube, SoundCloud, etc.) with admin controls for adding, editing, and deleting links including cover art upload support.",
  "frontend/src/pages/MvaPage.tsx": "Static informational page describing the M.v.A (Modular Verse Architect) production style by Malik Johnson, with a preview audio player and site visit recording.",
  "frontend/src/pages/PurchaseHistoryPage.tsx": "Page that displays a user's beat purchase history and handles Stripe payment return flow, including recording purchases on the backend and providing download links for purchased files and licenses.",
  "frontend/src/pages/SectionDetailPage.tsx": "Forum section detail page that shows messages for a given section, supports sending/deleting messages, auto-refreshes every 3 seconds, and includes link-sharing toggle and section deletion for admins.",
  "frontend/src/pages/ShowcasePage.tsx": "Page for browsing approved artist showcases and highlights, with a submission dialog allowing users to upload audio and cover art, select beat metadata, and submit their showcase for review.",
  "frontend/src/pages/StorePage.tsx": "React page that displays the beat store with filtering by category, style, texture, and search query; records site visits on load and hides exclusive-sold beats from non-admin users.",
  "frontend/src/pages/ThreadDetailPage.tsx": "Empty file with no content.",
  "frontend/src/utils/purchaseTracking.ts": "Centralized localStorage utilities for managing pending and completed beat purchases, supporting both paid (Stripe) and free purchase flows with create/finalize/retrieve operations.",
  "frontend/src/utils/stripeReturn.ts": "Utilities for detecting, persisting, retrieving, and clearing Stripe return URL parameters across navigation, and for building the purchase history redirect URL after Stripe checkout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and removing URL query parameters from both regular and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-mode theme with oklch CSS variable-based color tokens, custom border radii, box shadows, and keyframe animations including accordion, fade-in, and purple glow effects.",
  "project_state.json": "Project state snapshot (version 48) describing MikupBeats as a full-stack ICP/Motoko + React beat-selling platform, documenting architecture, known issues, and feature status including Stripe integration, forum, audio playback, and admin dashboard."
}