{
  "backend/main.mo": "Main Motoko backend actor defining Beat and Mixtape data structures with rights/licensing, integrating blob storage, Stripe payments, access control, HTTP outcalls, and user approval systems with upgrade hooks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React/TypeScript components, pages, hooks, and styles including authentication, beat browsing, Stripe integration, admin panels, and UI theming with purple accents and solid backgrounds.",
  "frontend/DEPLOYMENT_DEBUGGING.md": "Deployment debugging guide recommending automated retry wrapper for capturing and troubleshooting deployment issues.",
  "frontend/index.html": "HTML entry point for the MikupBeats application with root div and module script reference.",
  "frontend/index.ts": "Fragment displaying author name with fallback to 'Anonymous', likely misplaced code snippet.",
  "frontend/scripts/capture-deploy-output.ps1": "PowerShell script that captures dfx deployment output to timestamped logs with secret redaction (Stripe keys, tokens) and detailed phase-by-phase troubleshooting hints.",
  "frontend/scripts/capture-deploy-output.sh": "Bash script that captures dfx deployment output to timestamped logs with secret redaction and detailed troubleshooting guidance for Unix/macOS/Linux platforms.",
  "frontend/scripts/retry-deploy-with-capture.mjs": "Cross-platform Node.js wrapper that detects OS and invokes the appropriate deployment capture script (PowerShell or Bash) with user-friendly progress reporting and failure diagnostics.",
  "frontend/src/App.tsx": "Main application entry point that sets up routing, authentication, theme provider, and layout structure. Handles Stripe return redirects and post-login navigation with React Query and Tanstack Router.",
  "frontend/src/components/AdminHelpSection.tsx": "Accordion-based help documentation component that provides an overview of platform features including authentication, beat store, checkout, and user roles. Uses shadcn/ui Card and Accordion components with icons.",
  "frontend/src/components/AdminPage.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AdminPanel.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AnalyticsSection.tsx": "Analytics dashboard component displaying visit statistics, unique visitors, daily trends via Recharts line charts, and page-specific metrics. Includes visitor exclusion toggle functionality for admin users.",
  "frontend/src/components/ApprovalManagement.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ApprovalRequest.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AssetManagementSection.tsx": "Asset management UI component with type selection (audio, preview, cover, license) and download functionality. Currently displays a warning that backend implementation is not yet available.",
  "frontend/src/components/BasicRightsLicenseManagement.tsx": "Component for uploading, downloading, and deleting the Basic Rights license document (PDF/DOC/TXT) that gets bundled with beat purchases. Includes file validation, size limits, and confirmation dialogs.",
  "frontend/src/components/BeatCard.tsx": "Displays a beat card with cover art, play/pause controls, purchase buttons for different rights tiers, and handles both free and paid checkout flows via Stripe or direct recording.",
  "frontend/src/components/BeatManagementSection.tsx": "Admin component for managing beats with accordion list view, delete/edit/reopen actions, and displays rights status and delivery method details for each beat.",
  "frontend/src/components/BeatReviewSection.tsx": "Empty file with no content.",
  "frontend/src/components/BeatsSection.tsx": "Empty file with no content.",
  "frontend/src/components/BeatUploadSection.tsx": "Admin form for uploading beats with metadata (title, artist, category, style, texture), preview file, cover art, and multiple rights tiers (basic/premium/exclusive/stems) supporting both ZIP file uploads and Google Drive links based on delivery method.",
  "frontend/src/components/CreateThreadDialog.tsx": "Dialog component for creating new chat room sections with title, description, and optional link sharing toggle.",
  "frontend/src/components/DeployDiagnosticsBanner.tsx": "Fixed-position banner displaying build metadata (environment, version, build time, canister ID) with expandable troubleshooting tips for deployment debugging.",
  "frontend/src/components/DynamicHomeSequence.tsx": "Animated background component with studio imagery, gradient overlays, pulsing orbs, and user-configurable animation intensity, audio, and focus mode settings persisted to localStorage.",
  "frontend/src/components/EditBeatDialog.tsx": "Dialog component for editing beat metadata, including title, artist, category, style, texture, delivery method, preview/cover art uploads, and rights folder management (basic, premium, exclusive, stems) with pricing and Google Drive link options.",
  "frontend/src/components/ExclusiveRightsLicenseManagement.tsx": "Admin component for uploading, downloading, and deleting the exclusive rights license document (PDF/DOC/DOCX/TXT) that gets automatically included with exclusive rights ZIP downloads.",
  "frontend/src/components/FeaturedBeatManagement.tsx": "Admin component for selecting and managing the featured beat displayed at the top of the Store page, with options to set or clear the featured beat.",
  "frontend/src/components/FeaturedBeatSection.tsx": "Displays the featured beat on the Store page with cover art, play/pause controls, and a button to view full beat details.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty component file with no content.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/HamburgerMenu.tsx": "Side sheet navigation menu with links to Store, Showcase, Live, M.v.A, Music Links, Community Forum, Orders, and authentication controls (login/logout).",
  "frontend/src/components/Header.tsx": "Top header bar displaying the MikupBeats logo, user profile information when authenticated, and logout button.",
  "frontend/src/components/InteractiveTimeline.tsx": "Displays a horizontal scrollable timeline of milestones with navigation buttons, showing milestone cards with dates, titles, descriptions, and media. Includes loading states and responsive design with desktop/mobile layouts.",
  "frontend/src/components/LiveShowsManagement.tsx": "Admin component for managing upcoming shows and replays with CRUD operations. Provides tabbed interface with forms for adding/editing shows (title, date, time, description) and replays (title, description, URL).",
  "frontend/src/components/LiveStreamCard.tsx": "Empty file with no content.",
  "frontend/src/components/LiveStreamSection.tsx": "Empty file with no content.",
  "frontend/src/components/MilestoneManagement.tsx": "Admin component for managing milestones with CRUD operations. Provides dialog-based forms for creating/editing milestones with title, date, description, and media upload functionality.",
  "frontend/src/components/MixtapeApprovalSection.tsx": "Admin component for reviewing pending mixtapes with approve/reject/delete actions. Allows selecting a showcase highlight track from each mixtape before approval and includes audio preview functionality.",
  "frontend/src/components/MixtapeCard.tsx": "Displays a single mixtape with cover art, metadata, and audio player controls (play/pause, next/previous track). Includes delete functionality for admins and owners with confirmation dialog.",
  "frontend/src/components/MixtapeSubmissionFeeConfig.tsx": "Admin component for configuring mixtape submission fees, including enabling/disabling paid submissions and setting the price in USD (stored as cents). Displays current configuration and allows saving changes with validation.",
  "frontend/src/components/MixtapeSubmissionForm.tsx": "Dialog form for submitting mixtapes with title, artist, description, cover art, audio files (MP3/M4A/WAV only), and external links. Handles payment flow via Stripe checkout when fees are enabled, with strict audio format validation and upload progress tracking.",
  "frontend/src/components/MvaPreviewUploadSection.tsx": "Admin component for uploading, previewing, and deleting M.v.A preview media files (audio or video). Includes upload progress tracking, playback controls via audio player context, and confirmation dialogs for deletion.",
  "frontend/src/components/PremiumRightsLicenseManagement.tsx": "Admin component for managing the Premium Rights License document (PDF/DOC/DOCX/TXT) that gets included in Premium Right ZIP downloads. Supports upload with validation, download, and deletion with confirmation dialog.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup, collecting name and creator status. Prevents dismissal until profile is completed and calls onComplete callback after successful save.",
  "frontend/src/components/QuickLinkBar.tsx": "Fixed bottom navigation bar with icon buttons for main app sections (Store, Showcase, Live, M.v.A, Music, Forum, Mixtapes). Conditionally shows Admin link for admin users and highlights active route.",
  "frontend/src/components/ShowcaseApprovalSection.tsx": "Admin component for reviewing and approving pending showcase submissions with audio playback, batch approval, and delete functionality. Displays showcase details in an accordion with formatted categories, styles, and textures.",
  "frontend/src/components/ShowcaseCard.tsx": "Displays an individual approved showcase with cover art, audio playback controls, metadata badges, and admin delete functionality. Integrates with unified audio player context for playback management.",
  "frontend/src/components/ShowcaseHighlightCard.tsx": "Card component for displaying featured tracks from mixtapes with audio playback and navigation to full mixtape view. Uses unified audio player context and shows special mixtape badge.",
  "frontend/src/components/ShowcaseSection.tsx": "Empty file with no content.",
  "frontend/src/components/StartStreamDialog.tsx": "Empty file with no content.",
  "frontend/src/components/StemsRightsLicenseManagement.tsx": "Admin component for uploading, downloading, and deleting the stems rights license document that gets included with ZIP downloads. Validates file types (PDF, DOC, DOCX, TXT) and enforces 10MB size limit.",
  "frontend/src/components/StripeConfigSection.tsx": "Admin configuration form for setting up Stripe payment processing with secret key and allowed countries. Shows configuration status and validates input before saving.",
  "frontend/src/components/StripeSetup.tsx": "Empty file with no content.",
  "frontend/src/components/UploadBeatDialog.tsx": "Empty file with no content.",
  "frontend/src/components/YouTubeConfigSection.tsx": "Admin component for configuring YouTube live stream embed URL with preview functionality. Validates YouTube URLs and provides save/delete operations with live iframe preview.",
  "frontend/src/contexts/AudioPlayerContext.tsx": "React context provider for global audio playback control, managing play/pause/stop state and a shared audio element reference across the application.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control with an admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing login/logout functionality, identity state management, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including beats, showcases, user profiles, mixtapes, shopping items, Stripe configuration, analytics, and admin operations.",
  "frontend/src/hooks/useStripePreflight.ts": "Hook that checks Stripe configuration status and provides consistent error messaging for checkout preflight validation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a dark theme with deep grey backgrounds, vivid purple accents, and solid opaque overlays for dialogs and sheets.",
  "frontend/src/lib/audioConverter.ts": "Utilities for detecting, validating, and converting audio files to browser-compatible formats (WebM/Opus or MP4) using MediaRecorder API for cross-browser playback compatibility.",
  "frontend/src/lib/beatRights.ts": "Provides utilities for managing beat licensing rights (Basic, Premium, Exclusive, Stems), including functions to check if beats are sold, determine purchase eligibility, and generate buyer-facing licensing text.",
  "frontend/src/lib/buildMeta.ts": "Exposes build-time metadata (version, build time, environment, canister ID) extracted from environment variables and runtime context, with utilities to format and log deployment information.",
  "frontend/src/lib/checkoutDebug.ts": "Provides structured console logging for checkout flow debugging with sanitization to prevent logging of secrets, API keys, or sensitive configuration data.",
  "frontend/src/lib/mediaProcessor.ts": "Unified media processor that detects, validates, and processes audio/video files for preview playback, including extracting audio from video and trimming files to 30 seconds.",
  "frontend/src/lib/mediaTrimmer.ts": "Client-side utility to trim audio or video files to a maximum of 30 seconds using MediaRecorder API and captureStream, returning a new File object with trimmed content.",
  "frontend/src/lib/stripeCheckout.ts": "Validates Stripe checkout URLs and sanitizes error messages by removing sensitive data patterns (API keys, tokens) while providing user-friendly error messages for common checkout failures.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AboutPage.tsx": "Empty component file for the About page (no implementation present).",
  "frontend/src/pages/AccountSetupPage.tsx": "User profile setup page allowing users to enter their name and indicate if they are a creator/artist, with form validation and profile save functionality.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed interface for managing beats, showcases, mixtapes, licenses, analytics, and platform settings. Includes 14 tabs with icons for different admin functions like uploads, featured beats, YouTube config, Stripe config, and license management.",
  "frontend/src/pages/BeatDetailsPage.tsx": "Beat details page displaying beat information, preview playback (audio/video with 60s limit), and purchase options for different rights types. Handles both free and paid purchases via Stripe checkout with preflight validation and purchase tracking.",
  "frontend/src/pages/ForumPage.tsx": "Community forum page displaying chat room sections in a grid layout. Admins can create and delete sections, and users can navigate to individual section pages. Records site visits for analytics.",
  "frontend/src/pages/LivePage.tsx": "Live streaming page with embedded YouTube player, upcoming shows section, and replays section. Displays configured live stream URL or shows placeholder message when no stream is active.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page with hero section, MikupBeats branding, dynamic background sequence, and Internet Identity login button. Shows alert for pending purchases and includes interactive timeline component.",
  "frontend/src/pages/MainApp.tsx": "Empty main app component file with no content.",
  "frontend/src/pages/MixtapesPage.tsx": "Mixtapes gallery page displaying approved mixtapes in a grid with search functionality. Authenticated users can submit mixtapes via form, and page records site visits for analytics.",
  "frontend/src/pages/MusicLinksPage.tsx": "Admin page for managing external music platform links (Spotify, Apple Music, YouTube, SoundCloud). Provides CRUD operations with cover art upload, platform selection, and release date tracking.",
  "frontend/src/pages/MvaPage.tsx": "Marketing/informational page explaining M.v.A (Modular Verse Architect), a proprietary hip-hop production style. Includes audio preview playback and records site visits for analytics.",
  "frontend/src/pages/PurchaseHistoryPage.tsx": "Displays user's completed beat purchases with download links for files and licenses. Handles Stripe payment return flow, finalizes purchases, and provides Google Drive or direct ZIP downloads based on delivery method.",
  "frontend/src/pages/SectionDetailPage.tsx": "Forum section detail view with real-time messaging (3-second polling). Supports link sharing toggle, message deletion, section deletion, and auto-scrolling to new messages with clickable URL parsing.",
  "frontend/src/pages/ShowcasePage.tsx": "User-facing showcase submission and browsing page with search functionality. Allows authenticated users to submit songs with audio/cover art uploads, metadata (category, style, texture), and displays approved showcases with highlights section.",
  "frontend/src/pages/StorePage.tsx": "Main beat store page with filtering (category, style, texture, search), featured beat section, and grid display of BeatCard components; hides exclusive-sold beats from non-admins and records site visits.",
  "frontend/src/pages/ThreadDetailPage.tsx": "Empty file with no content.",
  "frontend/src/utils/purchaseTracking.ts": "Centralized localStorage utilities for managing pending and completed purchase records (both paid and free), including creation, finalization, and retrieval of purchase metadata.",
  "frontend/src/utils/stripeReturn.ts": "Utility functions for detecting, persisting, and retrieving Stripe return parameters (beatId, rightsType, sessionId) across login flows using sessionStorage.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence and cleanup functions for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using oklch variables, extended animations (accordion, fade-in, pulse-glow, border-glow), and shadcn/radix integration.",
  "project_state.json": "Project metadata documenting MikupBeats as a full-stack IC/Motoko beat marketplace with Internet Identity auth, admin CMS, Stripe checkout, forum, analytics, and known issues including YouTube config, Stripe flow bugs, and incomplete analytics."
}