{
  "backend/main.mo": "Main backend actor implementing a beat marketplace and mixtape showcase platform with Stripe payments, user authentication, access control, blob storage for audio/license files, and rights management (basic, premium, exclusive, stems) with approval workflows.",
  "backend/migration.mo": "Migration module that transforms old message records (with Text user field) to new internal messages (with Principal field), setting all migrated messages to anonymous principal.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to display user profile names instead of principals in forum messages on the SectionDetailPage component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, and styling with details on authentication, beat browsing, Stripe integration, admin panels, and UI theming.",
  "frontend/DEPLOYMENT_DEBUGGING.md": "Deployment debugging guide introducing automated retry wrapper scripts for capturing and troubleshooting deployment issues.",
  "frontend/index.html": "HTML entry point for the MikupBeats React application with root div and module script reference.",
  "frontend/scripts/capture-deploy-output.ps1": "PowerShell script that captures dfx deployment output to timestamped log files with automatic secret redaction (Stripe keys, tokens) and detailed phase-by-phase troubleshooting hints.",
  "frontend/scripts/capture-deploy-output.sh": "Bash script that captures dfx deployment output to timestamped log files with automatic secret redaction and detailed troubleshooting guidance for Unix/macOS/Linux platforms.",
  "frontend/scripts/retry-deploy-with-capture.mjs": "Cross-platform Node.js wrapper that detects the OS and invokes the appropriate deployment capture script (PowerShell or Bash) with user-friendly progress reporting and failure diagnostics.",
  "frontend/src/App.tsx": "Main application entry point that sets up routing, authentication, theme provider, and layout components. Handles Stripe return redirects and post-login navigation with QueryClient and TanStack Router.",
  "frontend/src/components/AdminHelpSection.tsx": "Accordion-based help documentation component that provides comprehensive guides for authentication, beat store, checkout, and other platform features. Uses Card and Accordion UI components with icons and badges.",
  "frontend/src/components/AdminPage.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AdminPanel.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AnalyticsSection.tsx": "Analytics dashboard displaying visit statistics, unique visitors, daily trends via line charts, and page-specific metrics. Includes visitor exclusion toggle functionality for admin users.",
  "frontend/src/components/ApprovalManagement.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ApprovalRequest.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AssetManagementSection.tsx": "Placeholder component for asset management (audio, preview, cover art, license files) with UI for selecting asset types and downloading. Shows alert that backend functionality is not yet implemented.",
  "frontend/src/components/BasicRightsLicenseManagement.tsx": "Component for uploading, downloading, and deleting the Basic Rights License document (PDF/DOC/TXT) that gets included in beat purchase ZIP files. Includes file validation, size limits, and confirmation dialogs.",
  "frontend/src/components/BeatCard.tsx": "Displays a beat card with cover art, play/pause controls, purchase buttons for different rights tiers, and handles both free and paid checkout flows via Stripe or direct purchase recording.",
  "frontend/src/components/BeatManagementSection.tsx": "Admin component for managing beats with accordion list view, delete/edit/reopen actions, and displays rights status and delivery method details for each beat.",
  "frontend/src/components/BeatReviewSection.tsx": "Empty file with no content.",
  "frontend/src/components/BeatsSection.tsx": "Empty file with no content.",
  "frontend/src/components/BeatUploadSection.tsx": "Admin form for uploading beats with metadata (title, artist, category, style, texture), preview file, cover art, and multiple rights tiers (basic/premium/exclusive/stems) supporting both ZIP file uploads and Google Drive links based on delivery method.",
  "frontend/src/components/CreateThreadDialog.tsx": "Dialog component for creating new chat room sections with title, description, and optional link sharing toggle.",
  "frontend/src/components/DeployDiagnosticsBanner.tsx": "Fixed-position banner displaying build metadata (environment, version, build time, canister ID) with expandable troubleshooting tips, shown in development or when explicitly enabled.",
  "frontend/src/components/DynamicHomeSequence.tsx": "Animated background component with configurable intensity levels, audio controls, focus mode, and respects prefers-reduced-motion, featuring gradient breathing effects and pulsing light orbs.",
  "frontend/src/components/EditBeatDialog.tsx": "Dialog component for editing beat metadata, including title, artist, category, style, texture, delivery method, preview/cover art uploads, and rights folder management (ZIP files or Google Drive links) with pricing options.",
  "frontend/src/components/ExclusiveRightsLicenseManagement.tsx": "Admin component for uploading, downloading, and deleting the exclusive rights license document (PDF/DOC/DOCX/TXT) that gets automatically included with exclusive rights ZIP downloads.",
  "frontend/src/components/FeaturedBeatManagement.tsx": "Admin component for selecting and managing the featured beat displayed at the top of the Store page, with options to set or clear the featured beat.",
  "frontend/src/components/FeaturedBeatSection.tsx": "Public-facing component that displays the featured beat with cover art, play/pause controls, and a button to view the full beat details page.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty component file with no content.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/HamburgerMenu.tsx": "Slide-out navigation menu with links to Store, Showcase, Live, M.v.A, Music Links, Community Forum, Orders (authenticated), and login/logout functionality.",
  "frontend/src/components/Header.tsx": "Top header bar displaying the MikupBeats logo, user profile name (if authenticated), and logout button.",
  "frontend/src/components/InteractiveTimeline.tsx": "Displays a horizontal scrollable timeline of milestones with navigation buttons, showing milestone cards with dates, titles, descriptions, and media. Includes responsive design with desktop horizontal and mobile vertical layouts.",
  "frontend/src/components/LiveShowsManagement.tsx": "Admin component for managing upcoming live shows and replays with CRUD operations. Provides tabbed interface with forms for adding/editing shows (title, date, time, description) and replays (title, description, URL).",
  "frontend/src/components/LiveStreamCard.tsx": "Empty file with no content.",
  "frontend/src/components/LiveStreamSection.tsx": "Empty file with no content.",
  "frontend/src/components/MilestoneManagement.tsx": "Admin component for managing milestones with CRUD operations, including file upload for media attachments. Provides dialog-based forms for creating/editing milestones with title, date, description, and optional media.",
  "frontend/src/components/MixtapeApprovalSection.tsx": "Admin component for reviewing pending mixtapes with approve/reject/delete actions and track selection for showcase highlights. Integrates audio player for previewing tracks and allows selecting which track to feature when approving.",
  "frontend/src/components/MixtapeCard.tsx": "Displays a mixtape with cover art, metadata, and playback controls for navigating through tracks. Includes delete functionality for admins and owners, integrated with the global audio player context.",
  "frontend/src/components/MixtapeSubmissionFeeConfig.tsx": "Admin component for configuring mixtape submission fees, including enabling/disabling paid submissions and setting the price in USD (stored as cents). Displays alerts about payment requirements and admin exemptions.",
  "frontend/src/components/MixtapeSubmissionForm.tsx": "Dialog form for submitting mixtapes with title, artist, description, cover art, songs (MP3/M4A/WAV only), and external links. Handles payment flow via Stripe checkout if fees are enabled, with strict audio format validation.",
  "frontend/src/components/MvaPreviewUploadSection.tsx": "Admin component for uploading, previewing, and deleting M.v.A preview media files (audio/video). Includes upload progress tracking, playback controls via audio player context, and confirmation dialogs for deletion.",
  "frontend/src/components/PremiumRightsLicenseManagement.tsx": "Admin component for managing the Premium Rights license document (PDF/DOC/DOCX/TXT) that gets included in ZIP downloads. Supports upload with validation, download, and deletion with confirmation dialog.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup requiring name input and optional creator flag. Prevents dismissal until profile is completed.",
  "frontend/src/components/QuickLinkBar.tsx": "Fixed bottom navigation bar with icon buttons for main app sections (Store, Showcase, Live, M.v.A, Music, Forum, Mixtapes). Conditionally shows Admin link for admin users with active state highlighting.",
  "frontend/src/components/ShowcaseApprovalSection.tsx": "Admin component for reviewing and approving pending showcase submissions with bulk approve functionality, audio playback, and delete capabilities.",
  "frontend/src/components/ShowcaseCard.tsx": "Displays an individual showcase with cover art, metadata badges, audio playback controls, and admin delete functionality.",
  "frontend/src/components/ShowcaseHighlightCard.tsx": "Card component for displaying featured tracks from mixtapes with audio playback and navigation to full mixtape view.",
  "frontend/src/components/ShowcaseSection.tsx": "Empty file with no content.",
  "frontend/src/components/StartStreamDialog.tsx": "Empty file with no content.",
  "frontend/src/components/StemsRightsLicenseManagement.tsx": "Admin component for uploading, downloading, and deleting the stems rights license document that accompanies ZIP downloads.",
  "frontend/src/components/StripeConfigSection.tsx": "Admin configuration interface for setting up Stripe payment processing with secret key and allowed countries.",
  "frontend/src/components/StripeSetup.tsx": "Empty file with no content.",
  "frontend/src/components/UploadBeatDialog.tsx": "Empty file with no content.",
  "frontend/src/components/YouTubeConfigSection.tsx": "Admin component for configuring and previewing YouTube live stream embed URLs with save and delete functionality.",
  "frontend/src/contexts/AudioPlayerContext.tsx": "React context provider for global audio playback state, managing play/pause/stop controls and a shared audio element reference across the application.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control with an admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including beats, showcases, user profiles, mixtapes, shopping items, Stripe configuration, and analytics.",
  "frontend/src/hooks/useStripePreflight.ts": "Hook that checks Stripe configuration status and provides consistent error messaging for checkout preflight validation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a dark theme with deep grey backgrounds, vivid purple accents, and forced solid opaque overlays for dialogs and sheets.",
  "frontend/src/lib/audioConverter.ts": "Utility functions for detecting, validating, and converting audio files to browser-compatible formats (WebM/Opus or MP4) using MediaRecorder API for cross-browser playback compatibility.",
  "frontend/src/lib/beatRights.ts": "Defines rights type labels, licensing text, and utility functions to check if beats are exclusively sold, if specific rights are sold, and if rights can be purchased based on exclusivity status.",
  "frontend/src/lib/buildMeta.ts": "Provides utilities to extract and format build metadata (build time, environment, version, canister ID) from environment variables and runtime context, with console logging support.",
  "frontend/src/lib/checkoutDebug.ts": "Structured console logging for checkout debugging that sanitizes error messages to remove sensitive data like API keys and tokens before logging.",
  "frontend/src/lib/mediaProcessor.ts": "Unified media processor that detects audio/video file types, validates formats, extracts audio from video files, and trims media to 30 seconds for preview playback. (Content truncated)",
  "frontend/src/lib/mediaTrimmer.ts": "Client-side media trimming utility that uses MediaRecorder API to trim audio or video files to 30 seconds maximum, returning original file if already under duration. (Content truncated)",
  "frontend/src/lib/stripeCheckout.ts": "Validates Stripe checkout URLs (HTTPS and domain checks) and sanitizes error messages by removing sensitive data patterns like API keys and bearer tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AboutPage.tsx": "Empty About page component (no content provided).",
  "frontend/src/pages/AccountSetupPage.tsx": "User profile setup page with form for name and creator status, using React Query hooks to fetch and save profile data with navigation to home on success.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed interface for managing beats, showcases, mixtapes, licenses, analytics, and platform settings. Includes sections for uploads, featured content, YouTube/Stripe config, live shows, milestones, and help.",
  "frontend/src/pages/BeatDetailsPage.tsx": "Beat details page displaying beat information, preview playback (with 60-second limit), and purchase functionality for different rights types. Handles both free and paid purchases via Stripe checkout with preflight validation.",
  "frontend/src/pages/ForumPage.tsx": "Community forum page displaying chat room sections with admin controls for creating and deleting rooms. Records site visits and provides navigation to individual section pages.",
  "frontend/src/pages/LivePage.tsx": "Live streaming page embedding YouTube live streams with sections for upcoming shows and replays. Records site visits and handles YouTube URL conversion to embed format.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page with Internet Identity authentication, hero banner, dynamic background sequence, and interactive timeline. Detects pending Stripe purchases and prompts login to complete them.",
  "frontend/src/pages/MainApp.tsx": "Empty main app component file with no content.",
  "frontend/src/pages/MixtapesPage.tsx": "Mixtapes gallery page displaying approved mixtapes with search filtering by title/artist. Includes submission form for authenticated users and records site visits.",
  "frontend/src/pages/MusicLinksPage.tsx": "Admin page for managing external music platform links (Spotify, Apple Music, YouTube, SoundCloud). Provides CRUD operations with cover art upload, platform selection, and release date tracking.",
  "frontend/src/pages/MvaPage.tsx": "Static informational page describing M.v.A (Modular Verse Architect), a proprietary hip-hop production style. Includes audio preview playback and records site visits for analytics.",
  "frontend/src/pages/PurchaseHistoryPage.tsx": "Displays user's completed beat purchases with download links for files and licenses. Handles Stripe payment return flow, validates session IDs, and records purchases on the backend with idempotency checks.",
  "frontend/src/pages/SectionDetailPage.tsx": "Forum section detail page with real-time messaging (3-second polling), URL link parsing with XSS sanitization, and admin controls for link sharing toggle and section deletion.",
  "frontend/src/pages/ShowcasePage.tsx": "User-facing showcase submission page with audio/cover art upload, beat metadata form (category, style, texture), file validation for audio formats, and display of approved showcases with highlights section.",
  "frontend/src/pages/StorePage.tsx": "Store page component that displays beats with filtering (category, style, texture, search), records site visits, hides exclusive-sold beats from non-admins, and includes a featured beat section with scroll position persistence.",
  "frontend/src/pages/ThreadDetailPage.tsx": "Empty file with no content.",
  "frontend/src/utils/purchaseTracking.ts": "Centralized localStorage utilities for managing pending and completed purchase records (both paid and free), including functions to create, finalize, and retrieve purchase data with beat metadata and delivery method.",
  "frontend/src/utils/stripeReturn.ts": "Utility for handling Stripe return flow across login by detecting, persisting, retrieving, and clearing Stripe return parameters (beatId, rightsType, sessionId) in sessionStorage and building purchase history URLs.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both hash-based and browser-based routing, providing functions to extract, persist, retrieve, and clear parameters from URLs and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color palette using OKLCH variables (purple/grey theme), extended animations (accordion, fade-in, pulse-glow, border-glow), and shadcn/radix integration.",
  "project_state.json": "Project metadata documenting MikupBeats as a full-stack IC/Motoko + React beat marketplace with Internet Identity auth, admin content management, Stripe checkout, secure delivery, forum, and analytics; includes architectural notes and known issues (YouTube config, Stripe flow bugs, analytics incomplete)."
}